RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4.h
#define LCD_WF_WF34(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF34_SHIFT))&LCD_WF_WF34_MASK)
#define LCD_WF_WF50_MASK                         0xFF0000u
#define LCD_WF_WF50_SHIFT                        16
#define LCD_WF_WF50_WIDTH                        8
#define LCD_WF_WF50(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF50_SHIFT))&LCD_WF_WF50_MASK)
#define LCD_WF_WF14_MASK                         0xFF0000u
#define LCD_WF_WF14_SHIFT                        16
#define LCD_WF_WF14_WIDTH                        8
#define LCD_WF_WF14(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF14_SHIFT))&LCD_WF_WF14_MASK)
#define LCD_WF_WF54_MASK                         0xFF0000u
#define LCD_WF_WF54_SHIFT                        16
#define LCD_WF_WF54_WIDTH                        8
#define LCD_WF_WF54(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF54_SHIFT))&LCD_WF_WF54_MASK)
#define LCD_WF_WF2_MASK                          0xFF0000u
#define LCD_WF_WF2_SHIFT                         16
#define LCD_WF_WF2_WIDTH                         8
#define LCD_WF_WF2(x)                            (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF2_SHIFT))&LCD_WF_WF2_MASK)
#define LCD_WF_WF58_MASK                         0xFF0000u
#define LCD_WF_WF58_SHIFT                        16
#define LCD_WF_WF58_WIDTH                        8
#define LCD_WF_WF58(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF58_SHIFT))&LCD_WF_WF58_MASK)
#define LCD_WF_WF30_MASK                         0xFF0000u
#define LCD_WF_WF30_SHIFT                        16
#define LCD_WF_WF30_WIDTH                        8
#define LCD_WF_WF30(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF30_SHIFT))&LCD_WF_WF30_MASK)
#define LCD_WF_WF62_MASK                         0xFF0000u
#define LCD_WF_WF62_SHIFT                        16
#define LCD_WF_WF62_WIDTH                        8
#define LCD_WF_WF62(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF62_SHIFT))&LCD_WF_WF62_MASK)
#define LCD_WF_WF10_MASK                         0xFF0000u
#define LCD_WF_WF10_SHIFT                        16
#define LCD_WF_WF10_WIDTH                        8
#define LCD_WF_WF10(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF10_SHIFT))&LCD_WF_WF10_MASK)
#define LCD_WF_WF63_MASK                         0xFF000000u
#define LCD_WF_WF63_SHIFT                        24
#define LCD_WF_WF63_WIDTH                        8
#define LCD_WF_WF63(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF63_SHIFT))&LCD_WF_WF63_MASK)
#define LCD_WF_WF59_MASK                         0xFF000000u
#define LCD_WF_WF59_SHIFT                        24
#define LCD_WF_WF59_WIDTH                        8
#define LCD_WF_WF59(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF59_SHIFT))&LCD_WF_WF59_MASK)
#define LCD_WF_WF55_MASK                         0xFF000000u
#define LCD_WF_WF55_SHIFT                        24
#define LCD_WF_WF55_WIDTH                        8
#define LCD_WF_WF55(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF55_SHIFT))&LCD_WF_WF55_MASK)
#define LCD_WF_WF3_MASK                          0xFF000000u
#define LCD_WF_WF3_SHIFT                         24
#define LCD_WF_WF3_WIDTH                         8
#define LCD_WF_WF3(x)                            (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF3_SHIFT))&LCD_WF_WF3_MASK)
#define LCD_WF_WF51_MASK                         0xFF000000u
#define LCD_WF_WF51_SHIFT                        24
#define LCD_WF_WF51_WIDTH                        8
#define LCD_WF_WF51(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF51_SHIFT))&LCD_WF_WF51_MASK)
#define LCD_WF_WF47_MASK                         0xFF000000u
#define LCD_WF_WF47_SHIFT                        24
#define LCD_WF_WF47_WIDTH                        8
#define LCD_WF_WF47(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF47_SHIFT))&LCD_WF_WF47_MASK)
#define LCD_WF_WF43_MASK                         0xFF000000u
#define LCD_WF_WF43_SHIFT                        24
#define LCD_WF_WF43_WIDTH                        8
#define LCD_WF_WF43(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF43_SHIFT))&LCD_WF_WF43_MASK)
#define LCD_WF_WF7_MASK                          0xFF000000u
#define LCD_WF_WF7_SHIFT                         24
#define LCD_WF_WF7_WIDTH                         8
#define LCD_WF_WF7(x)                            (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF7_SHIFT))&LCD_WF_WF7_MASK)
#define LCD_WF_WF39_MASK                         0xFF000000u
#define LCD_WF_WF39_SHIFT                        24
#define LCD_WF_WF39_WIDTH                        8
#define LCD_WF_WF39(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF39_SHIFT))&LCD_WF_WF39_MASK)
#define LCD_WF_WF35_MASK                         0xFF000000u
#define LCD_WF_WF35_SHIFT                        24
#define LCD_WF_WF35_WIDTH                        8
#define LCD_WF_WF35(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF35_SHIFT))&LCD_WF_WF35_MASK)
#define LCD_WF_WF31_MASK                         0xFF000000u
#define LCD_WF_WF31_SHIFT                        24
#define LCD_WF_WF31_WIDTH                        8
#define LCD_WF_WF31(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF31_SHIFT))&LCD_WF_WF31_MASK)
#define LCD_WF_WF11_MASK                         0xFF000000u
#define LCD_WF_WF11_SHIFT                        24
#define LCD_WF_WF11_WIDTH                        8
#define LCD_WF_WF11(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF11_SHIFT))&LCD_WF_WF11_MASK)
#define LCD_WF_WF27_MASK                         0xFF000000u
#define LCD_WF_WF27_SHIFT                        24
#define LCD_WF_WF27_WIDTH                        8
#define LCD_WF_WF27(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF27_SHIFT))&LCD_WF_WF27_MASK)
#define LCD_WF_WF23_MASK                         0xFF000000u
#define LCD_WF_WF23_SHIFT                        24
#define LCD_WF_WF23_WIDTH                        8
#define LCD_WF_WF23(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF23_SHIFT))&LCD_WF_WF23_MASK)
#define LCD_WF_WF19_MASK                         0xFF000000u
#define LCD_WF_WF19_SHIFT                        24
#define LCD_WF_WF19_WIDTH                        8
#define LCD_WF_WF19(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF19_SHIFT))&LCD_WF_WF19_MASK)
#define LCD_WF_WF15_MASK                         0xFF000000u
#define LCD_WF_WF15_SHIFT                        24
#define LCD_WF_WF15_WIDTH                        8
#define LCD_WF_WF15(x)                           (((uint32_t)(((uint32_t)(x))<<LCD_WF_WF15_SHIFT))&LCD_WF_WF15_MASK)
/* WF8B Bit Fields */
#define LCD_WF8B_BPALCD0_MASK                    0x1u
#define LCD_WF8B_BPALCD0_SHIFT                   0
#define LCD_WF8B_BPALCD0_WIDTH                   1
#define LCD_WF8B_BPALCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD0_SHIFT))&LCD_WF8B_BPALCD0_MASK)
#define LCD_WF8B_BPALCD63_MASK                   0x1u
#define LCD_WF8B_BPALCD63_SHIFT                  0
#define LCD_WF8B_BPALCD63_WIDTH                  1
#define LCD_WF8B_BPALCD63(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD63_SHIFT))&LCD_WF8B_BPALCD63_MASK)
#define LCD_WF8B_BPALCD62_MASK                   0x1u
#define LCD_WF8B_BPALCD62_SHIFT                  0
#define LCD_WF8B_BPALCD62_WIDTH                  1
#define LCD_WF8B_BPALCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD62_SHIFT))&LCD_WF8B_BPALCD62_MASK)
#define LCD_WF8B_BPALCD61_MASK                   0x1u
#define LCD_WF8B_BPALCD61_SHIFT                  0
#define LCD_WF8B_BPALCD61_WIDTH                  1
#define LCD_WF8B_BPALCD61(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD61_SHIFT))&LCD_WF8B_BPALCD61_MASK)
#define LCD_WF8B_BPALCD60_MASK                   0x1u
#define LCD_WF8B_BPALCD60_SHIFT                  0
#define LCD_WF8B_BPALCD60_WIDTH                  1
#define LCD_WF8B_BPALCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD60_SHIFT))&LCD_WF8B_BPALCD60_MASK)
#define LCD_WF8B_BPALCD59_MASK                   0x1u
#define LCD_WF8B_BPALCD59_SHIFT                  0
#define LCD_WF8B_BPALCD59_WIDTH                  1
#define LCD_WF8B_BPALCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD59_SHIFT))&LCD_WF8B_BPALCD59_MASK)
#define LCD_WF8B_BPALCD58_MASK                   0x1u
#define LCD_WF8B_BPALCD58_SHIFT                  0
#define LCD_WF8B_BPALCD58_WIDTH                  1
#define LCD_WF8B_BPALCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD58_SHIFT))&LCD_WF8B_BPALCD58_MASK)
#define LCD_WF8B_BPALCD57_MASK                   0x1u
#define LCD_WF8B_BPALCD57_SHIFT                  0
#define LCD_WF8B_BPALCD57_WIDTH                  1
#define LCD_WF8B_BPALCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD57_SHIFT))&LCD_WF8B_BPALCD57_MASK)
#define LCD_WF8B_BPALCD1_MASK                    0x1u
#define LCD_WF8B_BPALCD1_SHIFT                   0
#define LCD_WF8B_BPALCD1_WIDTH                   1
#define LCD_WF8B_BPALCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD1_SHIFT))&LCD_WF8B_BPALCD1_MASK)
#define LCD_WF8B_BPALCD56_MASK                   0x1u
#define LCD_WF8B_BPALCD56_SHIFT                  0
#define LCD_WF8B_BPALCD56_WIDTH                  1
#define LCD_WF8B_BPALCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD56_SHIFT))&LCD_WF8B_BPALCD56_MASK)
#define LCD_WF8B_BPALCD55_MASK                   0x1u
#define LCD_WF8B_BPALCD55_SHIFT                  0
#define LCD_WF8B_BPALCD55_WIDTH                  1
#define LCD_WF8B_BPALCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD55_SHIFT))&LCD_WF8B_BPALCD55_MASK)
#define LCD_WF8B_BPALCD54_MASK                   0x1u
#define LCD_WF8B_BPALCD54_SHIFT                  0
#define LCD_WF8B_BPALCD54_WIDTH                  1
#define LCD_WF8B_BPALCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD54_SHIFT))&LCD_WF8B_BPALCD54_MASK)
#define LCD_WF8B_BPALCD53_MASK                   0x1u
#define LCD_WF8B_BPALCD53_SHIFT                  0
#define LCD_WF8B_BPALCD53_WIDTH                  1
#define LCD_WF8B_BPALCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD53_SHIFT))&LCD_WF8B_BPALCD53_MASK)
#define LCD_WF8B_BPALCD52_MASK                   0x1u
#define LCD_WF8B_BPALCD52_SHIFT                  0
#define LCD_WF8B_BPALCD52_WIDTH                  1
#define LCD_WF8B_BPALCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD52_SHIFT))&LCD_WF8B_BPALCD52_MASK)
#define LCD_WF8B_BPALCD51_MASK                   0x1u
#define LCD_WF8B_BPALCD51_SHIFT                  0
#define LCD_WF8B_BPALCD51_WIDTH                  1
#define LCD_WF8B_BPALCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD51_SHIFT))&LCD_WF8B_BPALCD51_MASK)
#define LCD_WF8B_BPALCD50_MASK                   0x1u
#define LCD_WF8B_BPALCD50_SHIFT                  0
#define LCD_WF8B_BPALCD50_WIDTH                  1
#define LCD_WF8B_BPALCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD50_SHIFT))&LCD_WF8B_BPALCD50_MASK)
#define LCD_WF8B_BPALCD2_MASK                    0x1u
#define LCD_WF8B_BPALCD2_SHIFT                   0
#define LCD_WF8B_BPALCD2_WIDTH                   1
#define LCD_WF8B_BPALCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD2_SHIFT))&LCD_WF8B_BPALCD2_MASK)
#define LCD_WF8B_BPALCD49_MASK                   0x1u
#define LCD_WF8B_BPALCD49_SHIFT                  0
#define LCD_WF8B_BPALCD49_WIDTH                  1
#define LCD_WF8B_BPALCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD49_SHIFT))&LCD_WF8B_BPALCD49_MASK)
#define LCD_WF8B_BPALCD48_MASK                   0x1u
#define LCD_WF8B_BPALCD48_SHIFT                  0
#define LCD_WF8B_BPALCD48_WIDTH                  1
#define LCD_WF8B_BPALCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD48_SHIFT))&LCD_WF8B_BPALCD48_MASK)
#define LCD_WF8B_BPALCD47_MASK                   0x1u
#define LCD_WF8B_BPALCD47_SHIFT                  0
#define LCD_WF8B_BPALCD47_WIDTH                  1
#define LCD_WF8B_BPALCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD47_SHIFT))&LCD_WF8B_BPALCD47_MASK)
#define LCD_WF8B_BPALCD46_MASK                   0x1u
#define LCD_WF8B_BPALCD46_SHIFT                  0
#define LCD_WF8B_BPALCD46_WIDTH                  1
#define LCD_WF8B_BPALCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD46_SHIFT))&LCD_WF8B_BPALCD46_MASK)
#define LCD_WF8B_BPALCD45_MASK                   0x1u
#define LCD_WF8B_BPALCD45_SHIFT                  0
#define LCD_WF8B_BPALCD45_WIDTH                  1
#define LCD_WF8B_BPALCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD45_SHIFT))&LCD_WF8B_BPALCD45_MASK)
#define LCD_WF8B_BPALCD44_MASK                   0x1u
#define LCD_WF8B_BPALCD44_SHIFT                  0
#define LCD_WF8B_BPALCD44_WIDTH                  1
#define LCD_WF8B_BPALCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD44_SHIFT))&LCD_WF8B_BPALCD44_MASK)
#define LCD_WF8B_BPALCD43_MASK                   0x1u
#define LCD_WF8B_BPALCD43_SHIFT                  0
#define LCD_WF8B_BPALCD43_WIDTH                  1
#define LCD_WF8B_BPALCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD43_SHIFT))&LCD_WF8B_BPALCD43_MASK)
#define LCD_WF8B_BPALCD3_MASK                    0x1u
#define LCD_WF8B_BPALCD3_SHIFT                   0
#define LCD_WF8B_BPALCD3_WIDTH                   1
#define LCD_WF8B_BPALCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD3_SHIFT))&LCD_WF8B_BPALCD3_MASK)
#define LCD_WF8B_BPALCD42_MASK                   0x1u
#define LCD_WF8B_BPALCD42_SHIFT                  0
#define LCD_WF8B_BPALCD42_WIDTH                  1
#define LCD_WF8B_BPALCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD42_SHIFT))&LCD_WF8B_BPALCD42_MASK)
#define LCD_WF8B_BPALCD41_MASK                   0x1u
#define LCD_WF8B_BPALCD41_SHIFT                  0
#define LCD_WF8B_BPALCD41_WIDTH                  1
#define LCD_WF8B_BPALCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD41_SHIFT))&LCD_WF8B_BPALCD41_MASK)
#define LCD_WF8B_BPALCD40_MASK                   0x1u
#define LCD_WF8B_BPALCD40_SHIFT                  0
#define LCD_WF8B_BPALCD40_WIDTH                  1
#define LCD_WF8B_BPALCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD40_SHIFT))&LCD_WF8B_BPALCD40_MASK)
#define LCD_WF8B_BPALCD39_MASK                   0x1u
#define LCD_WF8B_BPALCD39_SHIFT                  0
#define LCD_WF8B_BPALCD39_WIDTH                  1
#define LCD_WF8B_BPALCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD39_SHIFT))&LCD_WF8B_BPALCD39_MASK)
#define LCD_WF8B_BPALCD38_MASK                   0x1u
#define LCD_WF8B_BPALCD38_SHIFT                  0
#define LCD_WF8B_BPALCD38_WIDTH                  1
#define LCD_WF8B_BPALCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD38_SHIFT))&LCD_WF8B_BPALCD38_MASK)
#define LCD_WF8B_BPALCD37_MASK                   0x1u
#define LCD_WF8B_BPALCD37_SHIFT                  0
#define LCD_WF8B_BPALCD37_WIDTH                  1
#define LCD_WF8B_BPALCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD37_SHIFT))&LCD_WF8B_BPALCD37_MASK)
#define LCD_WF8B_BPALCD36_MASK                   0x1u
#define LCD_WF8B_BPALCD36_SHIFT                  0
#define LCD_WF8B_BPALCD36_WIDTH                  1
#define LCD_WF8B_BPALCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD36_SHIFT))&LCD_WF8B_BPALCD36_MASK)
#define LCD_WF8B_BPALCD4_MASK                    0x1u
#define LCD_WF8B_BPALCD4_SHIFT                   0
#define LCD_WF8B_BPALCD4_WIDTH                   1
#define LCD_WF8B_BPALCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD4_SHIFT))&LCD_WF8B_BPALCD4_MASK)
#define LCD_WF8B_BPALCD35_MASK                   0x1u
#define LCD_WF8B_BPALCD35_SHIFT                  0
#define LCD_WF8B_BPALCD35_WIDTH                  1
#define LCD_WF8B_BPALCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD35_SHIFT))&LCD_WF8B_BPALCD35_MASK)
#define LCD_WF8B_BPALCD34_MASK                   0x1u
#define LCD_WF8B_BPALCD34_SHIFT                  0
#define LCD_WF8B_BPALCD34_WIDTH                  1
#define LCD_WF8B_BPALCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD34_SHIFT))&LCD_WF8B_BPALCD34_MASK)
#define LCD_WF8B_BPALCD33_MASK                   0x1u
#define LCD_WF8B_BPALCD33_SHIFT                  0
#define LCD_WF8B_BPALCD33_WIDTH                  1
#define LCD_WF8B_BPALCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD33_SHIFT))&LCD_WF8B_BPALCD33_MASK)
#define LCD_WF8B_BPALCD32_MASK                   0x1u
#define LCD_WF8B_BPALCD32_SHIFT                  0
#define LCD_WF8B_BPALCD32_WIDTH                  1
#define LCD_WF8B_BPALCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD32_SHIFT))&LCD_WF8B_BPALCD32_MASK)
#define LCD_WF8B_BPALCD31_MASK                   0x1u
#define LCD_WF8B_BPALCD31_SHIFT                  0
#define LCD_WF8B_BPALCD31_WIDTH                  1
#define LCD_WF8B_BPALCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD31_SHIFT))&LCD_WF8B_BPALCD31_MASK)
#define LCD_WF8B_BPALCD30_MASK                   0x1u
#define LCD_WF8B_BPALCD30_SHIFT                  0
#define LCD_WF8B_BPALCD30_WIDTH                  1
#define LCD_WF8B_BPALCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD30_SHIFT))&LCD_WF8B_BPALCD30_MASK)
#define LCD_WF8B_BPALCD29_MASK                   0x1u
#define LCD_WF8B_BPALCD29_SHIFT                  0
#define LCD_WF8B_BPALCD29_WIDTH                  1
#define LCD_WF8B_BPALCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD29_SHIFT))&LCD_WF8B_BPALCD29_MASK)
#define LCD_WF8B_BPALCD5_MASK                    0x1u
#define LCD_WF8B_BPALCD5_SHIFT                   0
#define LCD_WF8B_BPALCD5_WIDTH                   1
#define LCD_WF8B_BPALCD5(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD5_SHIFT))&LCD_WF8B_BPALCD5_MASK)
#define LCD_WF8B_BPALCD28_MASK                   0x1u
#define LCD_WF8B_BPALCD28_SHIFT                  0
#define LCD_WF8B_BPALCD28_WIDTH                  1
#define LCD_WF8B_BPALCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD28_SHIFT))&LCD_WF8B_BPALCD28_MASK)
#define LCD_WF8B_BPALCD27_MASK                   0x1u
#define LCD_WF8B_BPALCD27_SHIFT                  0
#define LCD_WF8B_BPALCD27_WIDTH                  1
#define LCD_WF8B_BPALCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD27_SHIFT))&LCD_WF8B_BPALCD27_MASK)
#define LCD_WF8B_BPALCD26_MASK                   0x1u
#define LCD_WF8B_BPALCD26_SHIFT                  0
#define LCD_WF8B_BPALCD26_WIDTH                  1
#define LCD_WF8B_BPALCD26(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD26_SHIFT))&LCD_WF8B_BPALCD26_MASK)
#define LCD_WF8B_BPALCD25_MASK                   0x1u
#define LCD_WF8B_BPALCD25_SHIFT                  0
#define LCD_WF8B_BPALCD25_WIDTH                  1
#define LCD_WF8B_BPALCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD25_SHIFT))&LCD_WF8B_BPALCD25_MASK)
#define LCD_WF8B_BPALCD24_MASK                   0x1u
#define LCD_WF8B_BPALCD24_SHIFT                  0
#define LCD_WF8B_BPALCD24_WIDTH                  1
#define LCD_WF8B_BPALCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD24_SHIFT))&LCD_WF8B_BPALCD24_MASK)
#define LCD_WF8B_BPALCD23_MASK                   0x1u
#define LCD_WF8B_BPALCD23_SHIFT                  0
#define LCD_WF8B_BPALCD23_WIDTH                  1
#define LCD_WF8B_BPALCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD23_SHIFT))&LCD_WF8B_BPALCD23_MASK)
#define LCD_WF8B_BPALCD22_MASK                   0x1u
#define LCD_WF8B_BPALCD22_SHIFT                  0
#define LCD_WF8B_BPALCD22_WIDTH                  1
#define LCD_WF8B_BPALCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD22_SHIFT))&LCD_WF8B_BPALCD22_MASK)
#define LCD_WF8B_BPALCD6_MASK                    0x1u
#define LCD_WF8B_BPALCD6_SHIFT                   0
#define LCD_WF8B_BPALCD6_WIDTH                   1
#define LCD_WF8B_BPALCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD6_SHIFT))&LCD_WF8B_BPALCD6_MASK)
#define LCD_WF8B_BPALCD21_MASK                   0x1u
#define LCD_WF8B_BPALCD21_SHIFT                  0
#define LCD_WF8B_BPALCD21_WIDTH                  1
#define LCD_WF8B_BPALCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD21_SHIFT))&LCD_WF8B_BPALCD21_MASK)
#define LCD_WF8B_BPALCD20_MASK                   0x1u
#define LCD_WF8B_BPALCD20_SHIFT                  0
#define LCD_WF8B_BPALCD20_WIDTH                  1
#define LCD_WF8B_BPALCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD20_SHIFT))&LCD_WF8B_BPALCD20_MASK)
#define LCD_WF8B_BPALCD19_MASK                   0x1u
#define LCD_WF8B_BPALCD19_SHIFT                  0
#define LCD_WF8B_BPALCD19_WIDTH                  1
#define LCD_WF8B_BPALCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD19_SHIFT))&LCD_WF8B_BPALCD19_MASK)
#define LCD_WF8B_BPALCD18_MASK                   0x1u
#define LCD_WF8B_BPALCD18_SHIFT                  0
#define LCD_WF8B_BPALCD18_WIDTH                  1
#define LCD_WF8B_BPALCD18(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD18_SHIFT))&LCD_WF8B_BPALCD18_MASK)
#define LCD_WF8B_BPALCD17_MASK                   0x1u
#define LCD_WF8B_BPALCD17_SHIFT                  0
#define LCD_WF8B_BPALCD17_WIDTH                  1
#define LCD_WF8B_BPALCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD17_SHIFT))&LCD_WF8B_BPALCD17_MASK)
#define LCD_WF8B_BPALCD16_MASK                   0x1u
#define LCD_WF8B_BPALCD16_SHIFT                  0
#define LCD_WF8B_BPALCD16_WIDTH                  1
#define LCD_WF8B_BPALCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD16_SHIFT))&LCD_WF8B_BPALCD16_MASK)
#define LCD_WF8B_BPALCD15_MASK                   0x1u
#define LCD_WF8B_BPALCD15_SHIFT                  0
#define LCD_WF8B_BPALCD15_WIDTH                  1
#define LCD_WF8B_BPALCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD15_SHIFT))&LCD_WF8B_BPALCD15_MASK)
#define LCD_WF8B_BPALCD7_MASK                    0x1u
#define LCD_WF8B_BPALCD7_SHIFT                   0
#define LCD_WF8B_BPALCD7_WIDTH                   1
#define LCD_WF8B_BPALCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD7_SHIFT))&LCD_WF8B_BPALCD7_MASK)
#define LCD_WF8B_BPALCD14_MASK                   0x1u
#define LCD_WF8B_BPALCD14_SHIFT                  0
#define LCD_WF8B_BPALCD14_WIDTH                  1
#define LCD_WF8B_BPALCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD14_SHIFT))&LCD_WF8B_BPALCD14_MASK)
#define LCD_WF8B_BPALCD13_MASK                   0x1u
#define LCD_WF8B_BPALCD13_SHIFT                  0
#define LCD_WF8B_BPALCD13_WIDTH                  1
#define LCD_WF8B_BPALCD13(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD13_SHIFT))&LCD_WF8B_BPALCD13_MASK)
#define LCD_WF8B_BPALCD12_MASK                   0x1u
#define LCD_WF8B_BPALCD12_SHIFT                  0
#define LCD_WF8B_BPALCD12_WIDTH                  1
#define LCD_WF8B_BPALCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD12_SHIFT))&LCD_WF8B_BPALCD12_MASK)
#define LCD_WF8B_BPALCD11_MASK                   0x1u
#define LCD_WF8B_BPALCD11_SHIFT                  0
#define LCD_WF8B_BPALCD11_WIDTH                  1
