RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4.h
#define LCD_WF8B_BPDLCD45_SHIFT                  3
#define LCD_WF8B_BPDLCD45_WIDTH                  1
#define LCD_WF8B_BPDLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD45_SHIFT))&LCD_WF8B_BPDLCD45_MASK)
#define LCD_WF8B_BPDLCD8_MASK                    0x8u
#define LCD_WF8B_BPDLCD8_SHIFT                   3
#define LCD_WF8B_BPDLCD8_WIDTH                   1
#define LCD_WF8B_BPDLCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD8_SHIFT))&LCD_WF8B_BPDLCD8_MASK)
#define LCD_WF8B_BPDLCD62_MASK                   0x8u
#define LCD_WF8B_BPDLCD62_SHIFT                  3
#define LCD_WF8B_BPDLCD62_WIDTH                  1
#define LCD_WF8B_BPDLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD62_SHIFT))&LCD_WF8B_BPDLCD62_MASK)
#define LCD_WF8B_BPDLCD33_MASK                   0x8u
#define LCD_WF8B_BPDLCD33_SHIFT                  3
#define LCD_WF8B_BPDLCD33_WIDTH                  1
#define LCD_WF8B_BPDLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD33_SHIFT))&LCD_WF8B_BPDLCD33_MASK)
#define LCD_WF8B_BPDLCD34_MASK                   0x8u
#define LCD_WF8B_BPDLCD34_SHIFT                  3
#define LCD_WF8B_BPDLCD34_WIDTH                  1
#define LCD_WF8B_BPDLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD34_SHIFT))&LCD_WF8B_BPDLCD34_MASK)
#define LCD_WF8B_BPDLCD29_MASK                   0x8u
#define LCD_WF8B_BPDLCD29_SHIFT                  3
#define LCD_WF8B_BPDLCD29_WIDTH                  1
#define LCD_WF8B_BPDLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD29_SHIFT))&LCD_WF8B_BPDLCD29_MASK)
#define LCD_WF8B_BPDLCD58_MASK                   0x8u
#define LCD_WF8B_BPDLCD58_SHIFT                  3
#define LCD_WF8B_BPDLCD58_WIDTH                  1
#define LCD_WF8B_BPDLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD58_SHIFT))&LCD_WF8B_BPDLCD58_MASK)
#define LCD_WF8B_BPDLCD57_MASK                   0x8u
#define LCD_WF8B_BPDLCD57_SHIFT                  3
#define LCD_WF8B_BPDLCD57_WIDTH                  1
#define LCD_WF8B_BPDLCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD57_SHIFT))&LCD_WF8B_BPDLCD57_MASK)
#define LCD_WF8B_BPDLCD42_MASK                   0x8u
#define LCD_WF8B_BPDLCD42_SHIFT                  3
#define LCD_WF8B_BPDLCD42_WIDTH                  1
#define LCD_WF8B_BPDLCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD42_SHIFT))&LCD_WF8B_BPDLCD42_MASK)
#define LCD_WF8B_BPDLCD35_MASK                   0x8u
#define LCD_WF8B_BPDLCD35_SHIFT                  3
#define LCD_WF8B_BPDLCD35_WIDTH                  1
#define LCD_WF8B_BPDLCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD35_SHIFT))&LCD_WF8B_BPDLCD35_MASK)
#define LCD_WF8B_BPDLCD52_MASK                   0x8u
#define LCD_WF8B_BPDLCD52_SHIFT                  3
#define LCD_WF8B_BPDLCD52_WIDTH                  1
#define LCD_WF8B_BPDLCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD52_SHIFT))&LCD_WF8B_BPDLCD52_MASK)
#define LCD_WF8B_BPDLCD7_MASK                    0x8u
#define LCD_WF8B_BPDLCD7_SHIFT                   3
#define LCD_WF8B_BPDLCD7_WIDTH                   1
#define LCD_WF8B_BPDLCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD7_SHIFT))&LCD_WF8B_BPDLCD7_MASK)
#define LCD_WF8B_BPDLCD36_MASK                   0x8u
#define LCD_WF8B_BPDLCD36_SHIFT                  3
#define LCD_WF8B_BPDLCD36_WIDTH                  1
#define LCD_WF8B_BPDLCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD36_SHIFT))&LCD_WF8B_BPDLCD36_MASK)
#define LCD_WF8B_BPDLCD30_MASK                   0x8u
#define LCD_WF8B_BPDLCD30_SHIFT                  3
#define LCD_WF8B_BPDLCD30_WIDTH                  1
#define LCD_WF8B_BPDLCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD30_SHIFT))&LCD_WF8B_BPDLCD30_MASK)
#define LCD_WF8B_BPDLCD41_MASK                   0x8u
#define LCD_WF8B_BPDLCD41_SHIFT                  3
#define LCD_WF8B_BPDLCD41_WIDTH                  1
#define LCD_WF8B_BPDLCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD41_SHIFT))&LCD_WF8B_BPDLCD41_MASK)
#define LCD_WF8B_BPDLCD37_MASK                   0x8u
#define LCD_WF8B_BPDLCD37_SHIFT                  3
#define LCD_WF8B_BPDLCD37_WIDTH                  1
#define LCD_WF8B_BPDLCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD37_SHIFT))&LCD_WF8B_BPDLCD37_MASK)
#define LCD_WF8B_BPDLCD44_MASK                   0x8u
#define LCD_WF8B_BPDLCD44_SHIFT                  3
#define LCD_WF8B_BPDLCD44_WIDTH                  1
#define LCD_WF8B_BPDLCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD44_SHIFT))&LCD_WF8B_BPDLCD44_MASK)
#define LCD_WF8B_BPDLCD63_MASK                   0x8u
#define LCD_WF8B_BPDLCD63_SHIFT                  3
#define LCD_WF8B_BPDLCD63_WIDTH                  1
#define LCD_WF8B_BPDLCD63(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD63_SHIFT))&LCD_WF8B_BPDLCD63_MASK)
#define LCD_WF8B_BPDLCD38_MASK                   0x8u
#define LCD_WF8B_BPDLCD38_SHIFT                  3
#define LCD_WF8B_BPDLCD38_WIDTH                  1
#define LCD_WF8B_BPDLCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD38_SHIFT))&LCD_WF8B_BPDLCD38_MASK)
#define LCD_WF8B_BPDLCD56_MASK                   0x8u
#define LCD_WF8B_BPDLCD56_SHIFT                  3
#define LCD_WF8B_BPDLCD56_WIDTH                  1
#define LCD_WF8B_BPDLCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD56_SHIFT))&LCD_WF8B_BPDLCD56_MASK)
#define LCD_WF8B_BPDLCD40_MASK                   0x8u
#define LCD_WF8B_BPDLCD40_SHIFT                  3
#define LCD_WF8B_BPDLCD40_WIDTH                  1
#define LCD_WF8B_BPDLCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD40_SHIFT))&LCD_WF8B_BPDLCD40_MASK)
#define LCD_WF8B_BPDLCD31_MASK                   0x8u
#define LCD_WF8B_BPDLCD31_SHIFT                  3
#define LCD_WF8B_BPDLCD31_WIDTH                  1
#define LCD_WF8B_BPDLCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD31_SHIFT))&LCD_WF8B_BPDLCD31_MASK)
#define LCD_WF8B_BPDLCD12_MASK                   0x8u
#define LCD_WF8B_BPDLCD12_SHIFT                  3
#define LCD_WF8B_BPDLCD12_WIDTH                  1
#define LCD_WF8B_BPDLCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD12_SHIFT))&LCD_WF8B_BPDLCD12_MASK)
#define LCD_WF8B_BPDLCD39_MASK                   0x8u
#define LCD_WF8B_BPDLCD39_SHIFT                  3
#define LCD_WF8B_BPDLCD39_WIDTH                  1
#define LCD_WF8B_BPDLCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD39_SHIFT))&LCD_WF8B_BPDLCD39_MASK)
#define LCD_WF8B_BPDLCD3_MASK                    0x8u
#define LCD_WF8B_BPDLCD3_SHIFT                   3
#define LCD_WF8B_BPDLCD3_WIDTH                   1
#define LCD_WF8B_BPDLCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD3_SHIFT))&LCD_WF8B_BPDLCD3_MASK)
#define LCD_WF8B_BPDLCD11_MASK                   0x8u
#define LCD_WF8B_BPDLCD11_SHIFT                  3
#define LCD_WF8B_BPDLCD11_WIDTH                  1
#define LCD_WF8B_BPDLCD11(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD11_SHIFT))&LCD_WF8B_BPDLCD11_MASK)
#define LCD_WF8B_BPELCD12_MASK                   0x10u
#define LCD_WF8B_BPELCD12_SHIFT                  4
#define LCD_WF8B_BPELCD12_WIDTH                  1
#define LCD_WF8B_BPELCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD12_SHIFT))&LCD_WF8B_BPELCD12_MASK)
#define LCD_WF8B_BPELCD39_MASK                   0x10u
#define LCD_WF8B_BPELCD39_SHIFT                  4
#define LCD_WF8B_BPELCD39_WIDTH                  1
#define LCD_WF8B_BPELCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD39_SHIFT))&LCD_WF8B_BPELCD39_MASK)
#define LCD_WF8B_BPELCD3_MASK                    0x10u
#define LCD_WF8B_BPELCD3_SHIFT                   4
#define LCD_WF8B_BPELCD3_WIDTH                   1
#define LCD_WF8B_BPELCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD3_SHIFT))&LCD_WF8B_BPELCD3_MASK)
#define LCD_WF8B_BPELCD38_MASK                   0x10u
#define LCD_WF8B_BPELCD38_SHIFT                  4
#define LCD_WF8B_BPELCD38_WIDTH                  1
#define LCD_WF8B_BPELCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD38_SHIFT))&LCD_WF8B_BPELCD38_MASK)
#define LCD_WF8B_BPELCD40_MASK                   0x10u
#define LCD_WF8B_BPELCD40_SHIFT                  4
#define LCD_WF8B_BPELCD40_WIDTH                  1
#define LCD_WF8B_BPELCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD40_SHIFT))&LCD_WF8B_BPELCD40_MASK)
#define LCD_WF8B_BPELCD37_MASK                   0x10u
#define LCD_WF8B_BPELCD37_SHIFT                  4
#define LCD_WF8B_BPELCD37_WIDTH                  1
#define LCD_WF8B_BPELCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD37_SHIFT))&LCD_WF8B_BPELCD37_MASK)
#define LCD_WF8B_BPELCD41_MASK                   0x10u
#define LCD_WF8B_BPELCD41_SHIFT                  4
#define LCD_WF8B_BPELCD41_WIDTH                  1
#define LCD_WF8B_BPELCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD41_SHIFT))&LCD_WF8B_BPELCD41_MASK)
#define LCD_WF8B_BPELCD36_MASK                   0x10u
#define LCD_WF8B_BPELCD36_SHIFT                  4
#define LCD_WF8B_BPELCD36_WIDTH                  1
#define LCD_WF8B_BPELCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD36_SHIFT))&LCD_WF8B_BPELCD36_MASK)
#define LCD_WF8B_BPELCD8_MASK                    0x10u
#define LCD_WF8B_BPELCD8_SHIFT                   4
#define LCD_WF8B_BPELCD8_WIDTH                   1
#define LCD_WF8B_BPELCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD8_SHIFT))&LCD_WF8B_BPELCD8_MASK)
#define LCD_WF8B_BPELCD35_MASK                   0x10u
#define LCD_WF8B_BPELCD35_SHIFT                  4
#define LCD_WF8B_BPELCD35_WIDTH                  1
#define LCD_WF8B_BPELCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD35_SHIFT))&LCD_WF8B_BPELCD35_MASK)
#define LCD_WF8B_BPELCD42_MASK                   0x10u
#define LCD_WF8B_BPELCD42_SHIFT                  4
#define LCD_WF8B_BPELCD42_WIDTH                  1
#define LCD_WF8B_BPELCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD42_SHIFT))&LCD_WF8B_BPELCD42_MASK)
#define LCD_WF8B_BPELCD34_MASK                   0x10u
#define LCD_WF8B_BPELCD34_SHIFT                  4
#define LCD_WF8B_BPELCD34_WIDTH                  1
#define LCD_WF8B_BPELCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD34_SHIFT))&LCD_WF8B_BPELCD34_MASK)
#define LCD_WF8B_BPELCD33_MASK                   0x10u
#define LCD_WF8B_BPELCD33_SHIFT                  4
#define LCD_WF8B_BPELCD33_WIDTH                  1
#define LCD_WF8B_BPELCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD33_SHIFT))&LCD_WF8B_BPELCD33_MASK)
#define LCD_WF8B_BPELCD11_MASK                   0x10u
#define LCD_WF8B_BPELCD11_SHIFT                  4
#define LCD_WF8B_BPELCD11_WIDTH                  1
#define LCD_WF8B_BPELCD11(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD11_SHIFT))&LCD_WF8B_BPELCD11_MASK)
#define LCD_WF8B_BPELCD43_MASK                   0x10u
#define LCD_WF8B_BPELCD43_SHIFT                  4
#define LCD_WF8B_BPELCD43_WIDTH                  1
#define LCD_WF8B_BPELCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD43_SHIFT))&LCD_WF8B_BPELCD43_MASK)
#define LCD_WF8B_BPELCD32_MASK                   0x10u
#define LCD_WF8B_BPELCD32_SHIFT                  4
#define LCD_WF8B_BPELCD32_WIDTH                  1
#define LCD_WF8B_BPELCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD32_SHIFT))&LCD_WF8B_BPELCD32_MASK)
#define LCD_WF8B_BPELCD31_MASK                   0x10u
#define LCD_WF8B_BPELCD31_SHIFT                  4
#define LCD_WF8B_BPELCD31_WIDTH                  1
#define LCD_WF8B_BPELCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD31_SHIFT))&LCD_WF8B_BPELCD31_MASK)
#define LCD_WF8B_BPELCD44_MASK                   0x10u
#define LCD_WF8B_BPELCD44_SHIFT                  4
#define LCD_WF8B_BPELCD44_WIDTH                  1
#define LCD_WF8B_BPELCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD44_SHIFT))&LCD_WF8B_BPELCD44_MASK)
#define LCD_WF8B_BPELCD30_MASK                   0x10u
#define LCD_WF8B_BPELCD30_SHIFT                  4
#define LCD_WF8B_BPELCD30_WIDTH                  1
#define LCD_WF8B_BPELCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD30_SHIFT))&LCD_WF8B_BPELCD30_MASK)
#define LCD_WF8B_BPELCD29_MASK                   0x10u
#define LCD_WF8B_BPELCD29_SHIFT                  4
#define LCD_WF8B_BPELCD29_WIDTH                  1
#define LCD_WF8B_BPELCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD29_SHIFT))&LCD_WF8B_BPELCD29_MASK)
#define LCD_WF8B_BPELCD7_MASK                    0x10u
#define LCD_WF8B_BPELCD7_SHIFT                   4
#define LCD_WF8B_BPELCD7_WIDTH                   1
#define LCD_WF8B_BPELCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD7_SHIFT))&LCD_WF8B_BPELCD7_MASK)
#define LCD_WF8B_BPELCD45_MASK                   0x10u
#define LCD_WF8B_BPELCD45_SHIFT                  4
#define LCD_WF8B_BPELCD45_WIDTH                  1
#define LCD_WF8B_BPELCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD45_SHIFT))&LCD_WF8B_BPELCD45_MASK)
#define LCD_WF8B_BPELCD28_MASK                   0x10u
#define LCD_WF8B_BPELCD28_SHIFT                  4
#define LCD_WF8B_BPELCD28_WIDTH                  1
#define LCD_WF8B_BPELCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD28_SHIFT))&LCD_WF8B_BPELCD28_MASK)
#define LCD_WF8B_BPELCD2_MASK                    0x10u
#define LCD_WF8B_BPELCD2_SHIFT                   4
#define LCD_WF8B_BPELCD2_WIDTH                   1
#define LCD_WF8B_BPELCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD2_SHIFT))&LCD_WF8B_BPELCD2_MASK)
#define LCD_WF8B_BPELCD27_MASK                   0x10u
#define LCD_WF8B_BPELCD27_SHIFT                  4
#define LCD_WF8B_BPELCD27_WIDTH                  1
#define LCD_WF8B_BPELCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD27_SHIFT))&LCD_WF8B_BPELCD27_MASK)
#define LCD_WF8B_BPELCD46_MASK                   0x10u
#define LCD_WF8B_BPELCD46_SHIFT                  4
#define LCD_WF8B_BPELCD46_WIDTH                  1
#define LCD_WF8B_BPELCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD46_SHIFT))&LCD_WF8B_BPELCD46_MASK)
#define LCD_WF8B_BPELCD26_MASK                   0x10u
#define LCD_WF8B_BPELCD26_SHIFT                  4
#define LCD_WF8B_BPELCD26_WIDTH                  1
#define LCD_WF8B_BPELCD26(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD26_SHIFT))&LCD_WF8B_BPELCD26_MASK)
#define LCD_WF8B_BPELCD10_MASK                   0x10u
#define LCD_WF8B_BPELCD10_SHIFT                  4
#define LCD_WF8B_BPELCD10_WIDTH                  1
#define LCD_WF8B_BPELCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD10_SHIFT))&LCD_WF8B_BPELCD10_MASK)
#define LCD_WF8B_BPELCD13_MASK                   0x10u
#define LCD_WF8B_BPELCD13_SHIFT                  4
#define LCD_WF8B_BPELCD13_WIDTH                  1
#define LCD_WF8B_BPELCD13(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD13_SHIFT))&LCD_WF8B_BPELCD13_MASK)
#define LCD_WF8B_BPELCD25_MASK                   0x10u
#define LCD_WF8B_BPELCD25_SHIFT                  4
#define LCD_WF8B_BPELCD25_WIDTH                  1
#define LCD_WF8B_BPELCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD25_SHIFT))&LCD_WF8B_BPELCD25_MASK)
#define LCD_WF8B_BPELCD5_MASK                    0x10u
#define LCD_WF8B_BPELCD5_SHIFT                   4
#define LCD_WF8B_BPELCD5_WIDTH                   1
#define LCD_WF8B_BPELCD5(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD5_SHIFT))&LCD_WF8B_BPELCD5_MASK)
#define LCD_WF8B_BPELCD24_MASK                   0x10u
#define LCD_WF8B_BPELCD24_SHIFT                  4
#define LCD_WF8B_BPELCD24_WIDTH                  1
#define LCD_WF8B_BPELCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD24_SHIFT))&LCD_WF8B_BPELCD24_MASK)
#define LCD_WF8B_BPELCD47_MASK                   0x10u
#define LCD_WF8B_BPELCD47_SHIFT                  4
#define LCD_WF8B_BPELCD47_WIDTH                  1
#define LCD_WF8B_BPELCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD47_SHIFT))&LCD_WF8B_BPELCD47_MASK)
#define LCD_WF8B_BPELCD23_MASK                   0x10u
#define LCD_WF8B_BPELCD23_SHIFT                  4
#define LCD_WF8B_BPELCD23_WIDTH                  1
#define LCD_WF8B_BPELCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD23_SHIFT))&LCD_WF8B_BPELCD23_MASK)
#define LCD_WF8B_BPELCD22_MASK                   0x10u
#define LCD_WF8B_BPELCD22_SHIFT                  4
#define LCD_WF8B_BPELCD22_WIDTH                  1
#define LCD_WF8B_BPELCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD22_SHIFT))&LCD_WF8B_BPELCD22_MASK)
#define LCD_WF8B_BPELCD48_MASK                   0x10u
#define LCD_WF8B_BPELCD48_SHIFT                  4
#define LCD_WF8B_BPELCD48_WIDTH                  1
#define LCD_WF8B_BPELCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD48_SHIFT))&LCD_WF8B_BPELCD48_MASK)
#define LCD_WF8B_BPELCD21_MASK                   0x10u
#define LCD_WF8B_BPELCD21_SHIFT                  4
#define LCD_WF8B_BPELCD21_WIDTH                  1
#define LCD_WF8B_BPELCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD21_SHIFT))&LCD_WF8B_BPELCD21_MASK)
#define LCD_WF8B_BPELCD49_MASK                   0x10u
#define LCD_WF8B_BPELCD49_SHIFT                  4
#define LCD_WF8B_BPELCD49_WIDTH                  1
#define LCD_WF8B_BPELCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD49_SHIFT))&LCD_WF8B_BPELCD49_MASK)
#define LCD_WF8B_BPELCD20_MASK                   0x10u
#define LCD_WF8B_BPELCD20_SHIFT                  4
#define LCD_WF8B_BPELCD20_WIDTH                  1
#define LCD_WF8B_BPELCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD20_SHIFT))&LCD_WF8B_BPELCD20_MASK)
#define LCD_WF8B_BPELCD19_MASK                   0x10u
#define LCD_WF8B_BPELCD19_SHIFT                  4
#define LCD_WF8B_BPELCD19_WIDTH                  1
#define LCD_WF8B_BPELCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD19_SHIFT))&LCD_WF8B_BPELCD19_MASK)
#define LCD_WF8B_BPELCD9_MASK                    0x10u
#define LCD_WF8B_BPELCD9_SHIFT                   4
#define LCD_WF8B_BPELCD9_WIDTH                   1
#define LCD_WF8B_BPELCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD9_SHIFT))&LCD_WF8B_BPELCD9_MASK)
#define LCD_WF8B_BPELCD50_MASK                   0x10u
#define LCD_WF8B_BPELCD50_SHIFT                  4
#define LCD_WF8B_BPELCD50_WIDTH                  1
#define LCD_WF8B_BPELCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD50_SHIFT))&LCD_WF8B_BPELCD50_MASK)
#define LCD_WF8B_BPELCD18_MASK                   0x10u
#define LCD_WF8B_BPELCD18_SHIFT                  4
#define LCD_WF8B_BPELCD18_WIDTH                  1
#define LCD_WF8B_BPELCD18(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD18_SHIFT))&LCD_WF8B_BPELCD18_MASK)
#define LCD_WF8B_BPELCD6_MASK                    0x10u
#define LCD_WF8B_BPELCD6_SHIFT                   4
#define LCD_WF8B_BPELCD6_WIDTH                   1
#define LCD_WF8B_BPELCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD6_SHIFT))&LCD_WF8B_BPELCD6_MASK)
#define LCD_WF8B_BPELCD17_MASK                   0x10u
#define LCD_WF8B_BPELCD17_SHIFT                  4
#define LCD_WF8B_BPELCD17_WIDTH                  1
#define LCD_WF8B_BPELCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD17_SHIFT))&LCD_WF8B_BPELCD17_MASK)
#define LCD_WF8B_BPELCD51_MASK                   0x10u
#define LCD_WF8B_BPELCD51_SHIFT                  4
#define LCD_WF8B_BPELCD51_WIDTH                  1
#define LCD_WF8B_BPELCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD51_SHIFT))&LCD_WF8B_BPELCD51_MASK)
#define LCD_WF8B_BPELCD16_MASK                   0x10u
#define LCD_WF8B_BPELCD16_SHIFT                  4
#define LCD_WF8B_BPELCD16_WIDTH                  1
#define LCD_WF8B_BPELCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD16_SHIFT))&LCD_WF8B_BPELCD16_MASK)
#define LCD_WF8B_BPELCD56_MASK                   0x10u
#define LCD_WF8B_BPELCD56_SHIFT                  4
#define LCD_WF8B_BPELCD56_WIDTH                  1
#define LCD_WF8B_BPELCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD56_SHIFT))&LCD_WF8B_BPELCD56_MASK)
#define LCD_WF8B_BPELCD57_MASK                   0x10u
#define LCD_WF8B_BPELCD57_SHIFT                  4
#define LCD_WF8B_BPELCD57_WIDTH                  1
#define LCD_WF8B_BPELCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD57_SHIFT))&LCD_WF8B_BPELCD57_MASK)
#define LCD_WF8B_BPELCD52_MASK                   0x10u
#define LCD_WF8B_BPELCD52_SHIFT                  4
#define LCD_WF8B_BPELCD52_WIDTH                  1
#define LCD_WF8B_BPELCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD52_SHIFT))&LCD_WF8B_BPELCD52_MASK)
#define LCD_WF8B_BPELCD1_MASK                    0x10u
#define LCD_WF8B_BPELCD1_SHIFT                   4
#define LCD_WF8B_BPELCD1_WIDTH                   1
#define LCD_WF8B_BPELCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD1_SHIFT))&LCD_WF8B_BPELCD1_MASK)
#define LCD_WF8B_BPELCD58_MASK                   0x10u
#define LCD_WF8B_BPELCD58_SHIFT                  4
#define LCD_WF8B_BPELCD58_WIDTH                  1
#define LCD_WF8B_BPELCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD58_SHIFT))&LCD_WF8B_BPELCD58_MASK)
#define LCD_WF8B_BPELCD59_MASK                   0x10u
#define LCD_WF8B_BPELCD59_SHIFT                  4
#define LCD_WF8B_BPELCD59_WIDTH                  1
#define LCD_WF8B_BPELCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD59_SHIFT))&LCD_WF8B_BPELCD59_MASK)
#define LCD_WF8B_BPELCD53_MASK                   0x10u
#define LCD_WF8B_BPELCD53_SHIFT                  4
#define LCD_WF8B_BPELCD53_WIDTH                  1
#define LCD_WF8B_BPELCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD53_SHIFT))&LCD_WF8B_BPELCD53_MASK)
#define LCD_WF8B_BPELCD14_MASK                   0x10u
#define LCD_WF8B_BPELCD14_SHIFT                  4
#define LCD_WF8B_BPELCD14_WIDTH                  1
#define LCD_WF8B_BPELCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD14_SHIFT))&LCD_WF8B_BPELCD14_MASK)
#define LCD_WF8B_BPELCD0_MASK                    0x10u
#define LCD_WF8B_BPELCD0_SHIFT                   4
#define LCD_WF8B_BPELCD0_WIDTH                   1
#define LCD_WF8B_BPELCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD0_SHIFT))&LCD_WF8B_BPELCD0_MASK)
#define LCD_WF8B_BPELCD60_MASK                   0x10u
#define LCD_WF8B_BPELCD60_SHIFT                  4
#define LCD_WF8B_BPELCD60_WIDTH                  1
#define LCD_WF8B_BPELCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD60_SHIFT))&LCD_WF8B_BPELCD60_MASK)
#define LCD_WF8B_BPELCD15_MASK                   0x10u
#define LCD_WF8B_BPELCD15_SHIFT                  4
#define LCD_WF8B_BPELCD15_WIDTH                  1
#define LCD_WF8B_BPELCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPELCD15_SHIFT))&LCD_WF8B_BPELCD15_MASK)
#define LCD_WF8B_BPELCD61_MASK                   0x10u
#define LCD_WF8B_BPELCD61_SHIFT                  4
#define LCD_WF8B_BPELCD61_WIDTH                  1
